xmlsamples/DAS_Query/PROD-SA-GetDeliveryServices-AIS-SAW54.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
            <device>
                <id>H2H</id>
                <type>RETAIL</type>
            </device>
            <channel>
                <type>H2H</type>
                <name>SAW54WAL001A</name>
                <version>9500</version>
            </channel>
            <foreign_remote_system>
                <identifier>WGBSSAW540P</identifier>
                <reference_no>WU15101020038813</reference_no>
                <counter_id>SAW54WAL001A</counter_id>
            </foreign_remote_system>
            <client_id>H2H</client_id>
         <name>GetDeliveryServices</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>SA SAR</queryfilter2>
            <queryfilter3>VN VND</queryfilter3>
            <queryfilter4>ALL</queryfilter4>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>